## 如何讓兩個list 相乘

In [9]:
a = [1,3,5,7,9]
b = [2,4,6,8,10]

# method 1
for i in range(0, len(a)):
    print(a[i] * b[i])

# method 2
ary = []
for i in range(0, len(a)):
    ary.append(a[i] * b[i])
print(ary)

# method 3
print([a[i] * b[i] for i in range(0, len(a))])

# method 4: zip
for f, s in zip(a, b):
    print(f * s)

# method 5
print([f * s for f,s in zip(a,b)])

2
12
30
56
90
[2, 12, 30, 56, 90]
[2, 12, 30, 56, 90]
2
12
30
56
90
[2, 12, 30, 56, 90]

## 在104 的爬蟲套用zip

In [14]:
import requests
res = requests.get('https://www.104.com.tw/jobbank/custjob/index.php?r=cust&j=623e466f383a426b34363e673c423a1d02d2d2d70463a4e2644j50')
res.encoding = 'utf-8'
#print(res.encoding)

In [18]:
from bs4 import BeautifulSoup
soup = BeautifulSoup(res.text, 'html.parser')
tag = soup.select('dt')
description = soup.select('dd')
for t, d in zip(tag, description):
    print(t.text,d.text.strip())

產業類別： 電腦軟體服務業
產業描述： 資訊軟體
員　　工： 10人
資 本 額： 200萬元
聯 絡 人： 丘先生
公司地址： 台北市中山區南京東路二段地圖
電　　話： 暫不提供
傳　　真： 暫不提供
公司網址： http://www.largitdata.com
相關連結： 更多





商業司登記
Google查公司名稱
求職服務專線 02-2912-6104 轉2
廠商求才專線

## Numpy

In [24]:
import numpy as np
na = np.array(a)
nb = np.array(b)
na * nb
na + nb
na - nb
na / nb

array([ 0.5       ,  0.75      ,  0.83333333,  0.875     ,  0.9       ])

## Numpy 1d array

In [32]:
a = [1,2,3,4,5]
print(type(a))

na = np.array(a)
print(type(na))

na[0]
na[1:3]

print(na >= 3)
print(na[na >= 3])

<class 'list'>
<class 'numpy.ndarray'>
[False False  True  True  True]
[3 4 5]

## Numpy 2d array

In [38]:
na = np.array([[1,2,3,4,5],[6,7,8,9,10]])
print(type(na))
print(na)
print(na[0,0])
print(na[0,:])
print(na[:,0])
print(na.T)

<class 'numpy.ndarray'>
[[ 1  2  3  4  5]
 [ 6  7  8  9 10]]
1
[1 2 3 4 5]
[1 6]
[[ 1  6]
 [ 2  7]
 [ 3  8]
 [ 4  9]
 [ 5 10]]

In [39]:
na = np.array([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
na

array([['frank', 'M', '29'],
       ['mary', 'F', '23'],
       ['tom', 'M', '35'],
       ['ted', 'M', '33'],
       ['jean', 'F', '21'],
       ['lisa', 'F', '20']],
      dtype='<U5')

## Pandas

In [41]:
import pandas as pd
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
df

       0  1   2
0  frank  M  29
1   mary  F  23
2    tom  M  35
3    ted  M  33
4   jean  F  21
5   lisa  F  20

In [42]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [43]:
df.columns = ['name', 'gender', 'age']

In [46]:
df['name']

0    frank
1     mary
2      tom
3      ted
4     jean
5     lisa
Name: name, dtype: object

## Pandas Series

In [47]:
import pandas as pd
s= pd.Series([21000,18900,18000])
s

0    21000
1    18900
2    18000
dtype: int64

In [48]:
s[1]

18900

In [52]:
s = pd.Series([21000, 18900, 18000], index = ['Iphone', 'Edge S7', 'HTC M1'])
print(s)
print(s['Iphone'])

Iphone     21000
Edge S7    18900
HTC M1     18000
dtype: int64
21000

In [55]:
dic = {
'Iphone':21000,
'Edge S7':18900,
'HTC M1':18000
}

s = pd.Series(dic)

In [59]:
print(s)
print(s[2])

Edge S7    18900
HTC M1     18000
Iphone     21000
dtype: int64
21000

In [60]:
print(s[1:3])

HTC M1    18000
Iphone    21000
dtype: int64

In [61]:
s['Iphone']

21000

In [62]:
s[['Iphone', 'HTC M1']]

Iphone    21000
HTC M1    18000
dtype: int64

In [66]:
s < 20000

Edge S7     True
HTC M1      True
Iphone     False
dtype: bool

In [65]:
s[s < 20000]

Edge S7    18900
HTC M1     18000
dtype: int64

In [69]:
cheap = s < 20000
cheap

Edge S7     True
HTC M1      True
Iphone     False
dtype: bool

In [70]:
s[cheap]

Edge S7    18900
HTC M1     18000
dtype: int64

In [72]:
print(s['Iphone'])
s['Iphone'] = 20000
print(s['Iphone'])

21000
20000

In [75]:
s[s<20000] = s[s< 20000] * 0.8

In [76]:
s

Edge S7    15120
HTC M1     14400
Iphone     20000
dtype: int64

In [77]:
'Iphone' in s

True

In [78]:
'mi' in s

False

In [80]:
s * 0.8

Edge S7    12096.0
HTC M1     11520.0
Iphone     16000.0
dtype: float64

In [82]:
import numpy as np
np.sqrt(s)

Edge S7    122.963409
HTC M1     120.000000
Iphone     141.421356
dtype: float64

In [86]:
s
print(s.max())
print(s.mean())
print(s.describe())

20000
16506.666666666668
count        3.000000
mean     16506.666667
std       3046.659373
min      14400.000000
25%      14760.000000
50%      15120.000000
75%      17560.000000
max      20000.000000
dtype: float64

In [89]:
s[['Iphone', 'HTC M1']]

Iphone    20000
HTC M1    14400
dtype: int64

In [91]:
s[['mi', 'HTC M1']]

mi            NaN
HTC M1    14400.0
dtype: float64

In [93]:
s2 = s[['Iphone', 'HTC M1']] + s[['mi', 'HTC M1']]

In [95]:
s2.isnull()

HTC M1    False
Iphone     True
mi         True
dtype: bool

In [96]:
s2.notnull()

HTC M1     True
Iphone    False
mi        False
dtype: bool

In [97]:
s2[s2.notnull()]

HTC M1    28800.0
dtype: float64

In [108]:
s = pd.Series(['Apple', 'Bananna', 'Cat'])

0      Apple
1    Bananna
2        Cat
dtype: object

In [121]:
def getApple(e):
    return 'Apple' in e

s[s.map(getApple)]

0    Apple
dtype: object

In [122]:
s[s.map(lambda e: 'Apple' in e)]

0    Apple
dtype: object

In [117]:
def square(e):
    return e * e

square(2)

4

In [118]:
square2 = lambda e : e * e
square2(3)

9

In [112]:
# contains => 檢查理面是否包含a
s[s.str.contains('a')]

1    Bananna
2        Cat
dtype: object

In [116]:
# match => 使用正規表達法檢查理面是否有比對到a的樣式
s[s.str.match('.*?a.*?')]

1    Bananna
2        Cat
dtype: object

In [110]:
s[s.map(lambda e: 'a' in e.lower())]

0      Apple
1    Bananna
2        Cat
dtype: object

## Pandas DataFrame

In [123]:
import pandas as pd
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
df

       0  1   2
0  frank  M  29
1   mary  F  23
2    tom  M  35
3    ted  M  33
4   jean  F  21
5   lisa  F  20

In [124]:
df.columns = ['name', 'gender', 'age']

In [125]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [126]:
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]]\
                  , columns = ['name', 'gender', 'age'])
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [127]:
df = pd.DataFrame([{'name':'frank', 'gender':'M', 'age':29}, \
                   {'name':'mary',  'gender':'F', 'age':23}, \
                   {'name':'tom',   'gender':'M', 'age':35}, \
                   {'name':'ted',   'gender':'M', 'age':33}, \
                   {'name':'jean',  'gender':'F', 'age':21}, \
                   {'name':'lisa',  'gender':'F', 'age':20}])
df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa

In [130]:
df = pd.DataFrame([{'name':'frank', 'gender':'M', 'age':29}, \
                   {'name':'mary',  'gender':'F', 'age':23, 'marriage': 'yes'}, \
                   {'name':'tom',   'gender':'M', 'age':35}])
df

   age gender marriage   name
0   29      M      NaN  frank
1   23      F      yes   mary
2   35      M      NaN    tom

## 整理三大法人交易資料

In [134]:
import requests
res = requests.get('http://www.twse.com.tw/fund/BFI82U?response=json&dayDate=&weekDate=&monthDate=&type=day&_=1503112639075')
df = pd.DataFrame(res.json()['data'])
df

           0               1               2               3
0  自營商(自行買賣)   1,025,069,400     850,792,577     174,276,823
1    自營商(避險)   4,591,078,711   4,949,618,576    -358,539,865
2         投信     703,309,860     869,642,577    -166,332,717
3      外資及陸資  18,946,611,191  23,751,447,432  -4,804,836,241
4         合計  25,266,069,162  30,421,501,162  -5,155,432,000

## 操作DataFrame

In [135]:
df = pd.DataFrame([{'name':'frank', 'gender':'M', 'age':29}, \
                   {'name':'mary',  'gender':'F', 'age':23}, \
                   {'name':'tom',   'gender':'M', 'age':35}, \
                   {'name':'ted',   'gender':'M', 'age':33}, \
                   {'name':'jean',  'gender':'F', 'age':21}, \
                   {'name':'lisa',  'gender':'F', 'age':20}])
df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa

In [136]:
df.head()

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean

In [137]:
df.tail()

   age gender  name
1   23      F  mary
2   35      M   tom
3   33      M   ted
4   21      F  jean
5   20      F  lisa

In [138]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
age       6 non-null int64
gender    6 non-null object
name      6 non-null object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [139]:
df.describe()

             age
count   6.000000
mean   26.833333
std     6.400521
min    20.000000
25%    21.500000
50%    26.000000
75%    32.000000
max    35.000000

In [141]:
df.dtypes

age        int64
gender    object
name      object
dtype: object

In [142]:
df.ix[1]

age         23
gender       F
name      mary
Name: 1, dtype: object

In [143]:
df.ix[1:4]

   age gender  name
1   23      F  mary
2   35      M   tom
3   33      M   ted
4   21      F  jean

In [144]:
df.ix[ : , ['name', 'gender'] ]

    name gender
0  frank      M
1   mary      F
2    tom      M
3    ted      M
4   jean      F
5   lisa      F

In [145]:
df.ix[   0:3 ,  :  ]

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted

In [146]:
# series
df['name']

0    frank
1     mary
2      tom
3      ted
4     jean
5     lisa
Name: name, dtype: object

In [149]:
df['name'].to_frame()

    name
0  frank
1   mary
2    tom
3    ted
4   jean
5   lisa

In [147]:
# dataframe
df[['name', 'gender']]

    name gender
0  frank      M
1   mary      F
2    tom      M
3    ted      M
4   jean      F
5   lisa      F

In [150]:
df.ix[1:2, ['name', 'gender']]

   name gender
1  mary      F
2   tom      M

## 資料篩選

In [154]:
df[df['gender'] == 'M']

   age gender   name
0   29      M  frank
2   35      M    tom
3   33      M    ted

In [157]:
df[(df['gender'] == 'M') & (df['age'] >= 30)]

   age gender name
2   35      M  tom
3   33      M  ted

In [158]:
df[(df['gender'] == 'M') | (df['age'] >= 30)]

   age gender   name
0   29      M  frank
2   35      M    tom
3   33      M    ted

In [160]:
df['employee'] = True

In [161]:
df

   age gender   name employee
0   29      M  frank     True
1   23      F   mary     True
2   35      M    tom     True
3   33      M    ted     True
4   21      F   jean     True
5   20      F   lisa     True

In [162]:
a = 100
a

100

In [163]:
del a

In [164]:
a

NameError: name 'a' is not defined

In [166]:
del df['employee']

In [167]:
df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa

In [169]:
df['employee'] = True
df.head()

   age gender   name employee
0   29      M  frank     True
1   23      F   mary     True
2   35      M    tom     True
3   33      M    ted     True
4   21      F   jean     True

In [172]:
df.drop('employee', 1, inplace=True)
df.head()

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean

In [173]:
df = pd.read_clipboard(sep = ':')

In [178]:
df = pd.DataFrame([['mary',12, 'F'], ['mary', 12, 'F'], ['mary', 23, 'F']])
df.columns = ['name', 'age', 'gender']
df.drop_duplicates()

   name  age gender
0  mary   12      F
2  mary   23      F

In [179]:
df.drop_duplicates('name', keep='first')

   name  age gender
0  mary   12      F

In [180]:
df = pd.DataFrame([{'name':'frank', 'gender':'M', 'age':29}, \
                   {'name':'mary',  'gender':'F', 'age':23}, \
                   {'name':'tom',   'gender':'M', 'age':35}, \
                   {'name':'ted',   'gender':'M', 'age':33}, \
                   {'name':'jean',  'gender':'F', 'age':21}, \
                   {'name':'lisa',  'gender':'F', 'age':20}])
df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa

In [182]:
df.loc[6] = {'age':20, 'gender': 'F', 'name' : 'QOO'}

In [190]:
df.drop(6)

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa

In [192]:
df
df.drop(6,inplace=True)

In [193]:
df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa

In [194]:
df['userid'] = range(101,107)

In [197]:
df.set_index('userid', inplace=True)
#df = df.set_index('userid')

In [202]:
df.iloc[1]
df.ix[102]

age         23
gender       F
name      mary
Name: 102, dtype: object

In [199]:
df.iloc[[1,3,5]]

        age gender  name
userid
102      23      F  mary
104      33      M   ted
106      20      F  lisa

In [203]:
df.ix[[101,103,105]]

        age gender   name
userid
101      29      M  frank
103      35      M    tom
105      21      F   jean

In [205]:
df.loc[[101,103,105]]

        age gender   name
userid
101      29      M  frank
103      35      M    tom
105      21      F   jean

## 處理缺失值

In [210]:
import numpy as np
np.nan
na = np.array([1,2,3,np.nan, 4, 5])
na.mean()

nan

In [239]:
import pandas as pd
import numpy  as np
df = pd.DataFrame([\
                   ['frank', 'M',    np.nan], \
                   ['mary' , np.nan, np.nan], \
                   ['tom'  , 'M',    35], \
                   ['ted'  , 'M',    33], \
                   ['jean' , np.nan, 21], \
                   ['lisa' , 'F',    20]])
df.columns = ['name', 'gender', 'age']
df

    name gender   age
0  frank      M   NaN
1   mary    NaN   NaN
2    tom      M  35.0
3    ted      M  33.0
4   jean    NaN  21.0
5   lisa      F  20.0

In [240]:
df['gender'].isnull()

0    False
1     True
2    False
3    False
4     True
5    False
Name: gender, dtype: bool

In [241]:
df[df['gender'].isnull()]

   name gender   age
1  mary    NaN   NaN
4  jean    NaN  21.0

In [242]:
df[df['gender'].notnull()]

    name gender   age
0  frank      M   NaN
2    tom      M  35.0
3    ted      M  33.0
5   lisa      F  20.0

In [243]:
df['name']

0    frank
1     mary
2      tom
3      ted
4     jean
5     lisa
Name: name, dtype: object

In [244]:
df.name

0    frank
1     mary
2      tom
3      ted
4     jean
5     lisa
Name: name, dtype: object

In [245]:
df.name.isnull().values.any()

False

In [246]:
df.gender.isnull().values.any()

True

In [247]:
df.isnull().values.any()

True

In [248]:
df.isnull().sum()

name      0
gender    2
age       2
dtype: int64

In [249]:
df.isnull().sum().sum()

4

In [250]:
df.dropna()
#df.dropna(inplace=True)

   name gender   age
2   tom      M  35.0
3   ted      M  33.0
5  lisa      F  20.0

In [251]:
df

    name gender   age
0  frank      M   NaN
1   mary    NaN   NaN
2    tom      M  35.0
3    ted      M  33.0
4   jean    NaN  21.0
5   lisa      F  20.0

In [254]:
?df.dropna

In [253]:
df.dropna(how='all')

    name gender   age
0  frank      M   NaN
1   mary    NaN   NaN
2    tom      M  35.0
3    ted      M  33.0
4   jean    NaN  21.0
5   lisa      F  20.0

In [255]:
df['employee'] = np.nan

In [258]:
df.dropna(axis = 1, how= 'all')

    name gender   age
0  frank      M   NaN
1   mary    NaN   NaN
2    tom      M  35.0
3    ted      M  33.0
4   jean    NaN  21.0
5   lisa      F  20.0

In [260]:
df.dropna(thresh=2)

    name gender   age  employee
0  frank      M   NaN       NaN
2    tom      M  35.0       NaN
3    ted      M  33.0       NaN
4   jean    NaN  21.0       NaN
5   lisa      F  20.0       NaN

In [262]:
del df['employee']

In [264]:
df['age'].fillna(0)

0     0.0
1     0.0
2    35.0
3    33.0
4    21.0
5    20.0
Name: age, dtype: float64

In [267]:
df.fillna(df['age'].mean())

    name gender    age
0  frank      M  27.25
1   mary  27.25  27.25
2    tom      M  35.00
3    ted      M  33.00
4   jean  27.25  21.00
5   lisa      F  20.00

In [271]:
df['age'].fillna(df.groupby('gender')['age'].transform('mean'))

0    34.0
1     NaN
2    35.0
3    33.0
4    21.0
5    20.0
Name: age, dtype: float64

In [275]:
df
df.fillna(method="pad")

    name gender   age
0  frank      M   NaN
1   mary      M   NaN
2    tom      M  35.0
3    ted      M  33.0
4   jean      M  21.0
5   lisa      F  20.0

In [276]:
df.fillna(method="bfill")

    name gender   age
0  frank      M  35.0
1   mary      M  35.0
2    tom      M  35.0
3    ted      M  33.0
4   jean      F  21.0
5   lisa      F  20.0

In [277]:
df.fillna(method="bfill",  limit = 2)

    name gender   age
0  frank      M  35.0
1   mary      M  35.0
2    tom      M  35.0
3    ted      M  33.0
4   jean      F  21.0
5   lisa      F  20.0

In [278]:
df2 = pd.DataFrame([[1, 870],\
                    [2, 900],\
                    [np.nan, np.nan],\
                    [4, 950],\
                    [5,1080],\
                    [6,1200]])
df2.columns = ['time', 'val']
df2.interpolate()

   time     val
0   1.0   870.0
1   2.0   900.0
2   3.0   925.0
3   4.0   950.0
4   5.0  1080.0
5   6.0  1200.0

## 檔案下載

In [280]:
import requests
res = requests.get('http://img.ltn.com.tw/Upload/ent/artist/800/1970/01/01/phpmdnkMq.jpg')
with open('puff.jpg', 'wb') as f:
    f.write(res.content)
    
from PIL import Image
#Image.open('puff.jpg')

## 數據轉換

In [279]:
import requests
res = requests.get('https://raw.githubusercontent.com/ywchiu/tibamepy/master/data/rent_591_sample.csv')
with open('rent_591_sample.csv', 'wb') as f:
    f.write(res.content)

In [283]:
%ls

 磁碟區 C 中的磁碟是 OS 7
 磁碟區序號:  C485-A13C

 C:\Users\User\tibamepy 的目錄

2017/08/19  下午 01:53    <DIR>          .
2017/08/19  下午 01:53    <DIR>          ..
2017/08/19  上午 09:41    <DIR>          .ipynb_checkpoints
2017/08/13  下午 04:27            58,482 appledaily.xlsx
2017/08/13  上午 11:11             9,028 Course_94.ipynb
2017/08/19  下午 01:48    <DIR>          data
2017/08/12  下午 05:39           119,926 Demo20170812.ipynb
2017/08/12  下午 12:33            67,554 Demo20170812_2.ipynb
2017/08/13  下午 05:34            70,800 Demo20170813.ipynb
2017/08/13  上午 10:52            18,653 Demo20170813_2.ipynb
2017/08/19  下午 01:53           114,448 Demo20170819.ipynb
2017/08/13  下午 05:24             7,423 house591.xlsx
2017/08/13  下午 05:33            34,748 house591_total.xlsx
2017/08/13  下午 03:30            10,649 news.xlsx
2017/08/13  上午 09:58             1,055 phone.jpg
2017/08/19  下午 01:52            65,730 puff.jpg
2017/08/19  上午 11:42               579 README.md
2017/08/19  下午 01:51        15,424,596 rent_591_sample.csv
2017/08/12  上午 10:48                43 test.py
2017/08/12  下午 05:12                12 test.txt
2017/08/17  上午 11:03    <DIR>          tmp
              16 個檔案      16,003,726 位元組
               5 個目錄   4,985,872,384 位元組可用

In [333]:
import pandas 
df = pandas.read_csv('rent_591_sample.csv', index_col=0, encoding='utf-8')
#df.info()
df.head(3)

,detail_url,search_date,title,address,floor_info,price,layout,building_area,building_use,latitude,longitude
0,https://rent.591.com.tw/rent-detail-1050934.html,2017-05-14,套房出租-近東方學院(六~八月可入住),高雄市湖內區民生街,3F/3F,"4,500元/月",NaN,6.0,透天厝/獨立套房,22.878436,120.250810
1,https://rent.591.com.tw/rent-detail-1008046.html,2017-05-14,好房子【聰明的你、妳快來租吧】,新北市蘆洲區長安街,4F/5F,"7,500元/月",NaN,10.0,透天厝/獨立套房,25.081558,121.461868
2,https://rent.591.com.tw/rent-detail-1586266.html,2017-05-12,陽台大套房(獨立洗衣機)近頂溪捷運站,新北市永和區中山路一段,8F/12F,"11,000元/月",NaN,8.0,電梯大樓/分租套房,25.010293,121.511328

In [334]:
df.columns

Index(['detail_url', 'search_date', 'title', 'address', 'floor_info', 'price',
       'layout', 'building_area', 'building_use', 'latitude', 'longitude'],
      dtype='object')

In [335]:
df['building_area'] / 0.3025

import numpy as np
np.sqrt(df['building_area'])

df['address'] + '-' + df['price']

df['square_feet'] = df['building_area'] / 0.3025
df.head()

,detail_url,search_date,title,address,floor_info,price,layout,building_area,building_use,latitude,longitude,square_feet
0,https://rent.591.com.tw/rent-detail-1050934.html,2017-05-14,套房出租-近東方學院(六~八月可入住),高雄市湖內區民生街,3F/3F,"4,500元/月",NaN,6.0,透天厝/獨立套房,22.878436,120.250810,19.834711
1,https://rent.591.com.tw/rent-detail-1008046.html,2017-05-14,好房子【聰明的你、妳快來租吧】,新北市蘆洲區長安街,4F/5F,"7,500元/月",NaN,10.0,透天厝/獨立套房,25.081558,121.461868,33.057851
2,https://rent.591.com.tw/rent-detail-1586266.html,2017-05-12,陽台大套房(獨立洗衣機)近頂溪捷運站,新北市永和區中山路一段,8F/12F,"11,000元/月",NaN,8.0,電梯大樓/分租套房,25.010293,121.511328,26.446281
3,https://rent.591.com.tw/rent-detail-1699948.html,2017-05-13,火車站附近~~優質套房,屏東縣潮州鎮六合路,3F/3F,"5,000元/月",NaN,8.0,透天厝/獨立套房,22.551346,120.538032,26.446281
4,https://rent.591.com.tw/rent-detail-1404725.html,2017-05-12,觀音四維路優質陽台套房,桃園市觀音區四維路,4F/5F,"5,000元/月",NaN,7.0,透天厝/分租套房,25.043652,121.141518,23.140496

In [336]:
df['price'].str.strip('元/月').head()

0     4,500
1     7,500
2    11,000
3     5,000
4     5,000
Name: price, dtype: object

In [337]:
def normalizePrice(price):
    #return int(price.strip('元/月').replace(',',''))
    return int(''.join(price.strip('元/月').split(',')))

normalizePrice('4,500元/月')

4500

In [338]:
# method 1
df['price'].map(normalizePrice).head()

# method 2
df['price'].map(lambda price: normalizePrice(price) ).head()

# method 3
df['price'].map(lambda price: int(''.join(price.strip('元/月').split(',')))).head()

0     4500
1     7500
2    11000
3     5000
4     5000
Name: price, dtype: int64

In [339]:
df['price'] = df['price'].map(lambda price: int(''.join(price.strip('元/月').split(','))))

In [340]:
df['price'].describe()

count    7.031500e+04
mean     3.701923e+04
std      1.216916e+05
min      5.000000e+02
25%      6.800000e+03
50%      1.400000e+04
75%      3.200000e+04
max      1.275000e+07
Name: price, dtype: float64

In [341]:
df[df['price'] <= 500]

,detail_url,search_date,title,address,floor_info,price,layout,building_area,building_use,latitude,longitude,square_feet
23599,https://rent.591.com.tw/rent-detail-5116111.html,2017-05-14,漢口路與華美街平面機車位出租,台中市北區太原一街,NaN,500,NaN,1.0,NaN,24.166003,120.66671,3.305785

In [342]:
df2 = pandas.DataFrame(\
[\
   [60,70,50],\
   [80,79,68],\
   [63,66,82]], \
  columns = ['First', 'Second', 'Third'])

df2.apply(lambda e: e.max() - e.min(), axis =0) # 根據行
df2.apply(lambda e: e.max() - e.min(), axis =1) # 根據列

0    20
1    12
2    19
dtype: int64

In [345]:
df.applymap(lambda e: '-' if pandas.isnull(e) else e).head(3)

,detail_url,search_date,title,address,floor_info,price,layout,building_area,building_use,latitude,longitude,square_feet
0,https://rent.591.com.tw/rent-detail-1050934.html,2017-05-14,套房出租-近東方學院(六~八月可入住),高雄市湖內區民生街,3F/3F,4500,-,6.0,透天厝/獨立套房,22.878436,120.250810,19.834711
1,https://rent.591.com.tw/rent-detail-1008046.html,2017-05-14,好房子【聰明的你、妳快來租吧】,新北市蘆洲區長安街,4F/5F,7500,-,10.0,透天厝/獨立套房,25.081558,121.461868,33.057851
2,https://rent.591.com.tw/rent-detail-1586266.html,2017-05-12,陽台大套房(獨立洗衣機)近頂溪捷運站,新北市永和區中山路一段,8F/12F,11000,-,8.0,電梯大樓/分租套房,25.010293,121.511328,26.446281

In [348]:
df.fillna('^_^').head()

,detail_url,search_date,title,address,floor_info,price,layout,building_area,building_use,latitude,longitude,square_feet
0,https://rent.591.com.tw/rent-detail-1050934.html,2017-05-14,套房出租-近東方學院(六~八月可入住),高雄市湖內區民生街,3F/3F,4500,^_^,6.0,透天厝/獨立套房,22.878436,120.250810,19.834711
1,https://rent.591.com.tw/rent-detail-1008046.html,2017-05-14,好房子【聰明的你、妳快來租吧】,新北市蘆洲區長安街,4F/5F,7500,^_^,10.0,透天厝/獨立套房,25.081558,121.461868,33.057851
2,https://rent.591.com.tw/rent-detail-1586266.html,2017-05-12,陽台大套房(獨立洗衣機)近頂溪捷運站,新北市永和區中山路一段,8F/12F,11000,^_^,8.0,電梯大樓/分租套房,25.010293,121.511328,26.446281
3,https://rent.591.com.tw/rent-detail-1699948.html,2017-05-13,火車站附近~~優質套房,屏東縣潮州鎮六合路,3F/3F,5000,^_^,8.0,透天厝/獨立套房,22.551346,120.538032,26.446281
4,https://rent.591.com.tw/rent-detail-1404725.html,2017-05-12,觀音四維路優質陽台套房,桃園市觀音區四維路,4F/5F,5000,^_^,7.0,透天厝/分租套房,25.043652,121.141518,23.140496

## 處理時間格式

In [350]:
from datetime import datetime
currenttime = datetime.now()
type(currenttime)

datetime.datetime

In [351]:
currenttime.strftime('%Y-%m-%d')

'2017-08-19'

In [357]:
s = '2017-08-08'
type(s)

#'2017-08-19' - '2017-08-08'
dt = datetime.strptime(s, '%Y-%m-%d')
currenttime - dt

datetime.timedelta(11, 52997, 763885)

In [359]:
(currenttime - dt).days

11

In [362]:
from datetime import datetime, timedelta
current_time = datetime.now()
current_time

current_time - timedelta(days = 10)

datetime.datetime(2017, 8, 9, 14, 49, 14, 576293)

In [365]:
for i in range(1,10):
    dt = current_time - timedelta(days = i)
    print(dt.strftime('%Y-%m-%d'))

2017-08-18
2017-08-17
2017-08-16
2017-08-15
2017-08-14
2017-08-13
2017-08-12
2017-08-11
2017-08-10

In [369]:
from time import mktime
mktime(current_time.timetuple())

datetime.fromtimestamp(1503125354)

datetime.datetime(2017, 8, 19, 14, 49, 14)

In [375]:
df['search_date'] = pandas.to_datetime(df['search_date'], format = '%Y-%m-%d')

In [381]:
df.sort_values('search_date', ascending=False).head(3)

,detail_url,search_date,title,address,floor_info,price,layout,building_area,building_use,latitude,longitude,square_feet
6917,https://rent.591.com.tw/rent-detail-5010732.html,2017-05-15,(租)三多百貨商圈金店面,高雄市苓雅區三多三路,1F/12F,105000,NaN,78.71,NaN,22.614534,120.306875,260.198347
3231,https://rent.591.com.tw/rent-detail-4920629.html,2017-05-15,中清路店面（近交流道）,台中市北屯區中清路,1F/5F,16800,NaN,11.00,透天厝/店面,24.179425,120.666659,36.363636
2820,https://rent.591.com.tw/rent-detail-4916344.html,2017-05-15,昌益藍海優質商辦-含車位,新竹市東區關新路,9F/16F,110000,NaN,73.00,電梯大樓/辦公,24.784179,121.017351,241.322314

In [386]:
#df['search_date'].dt.year
#df['search_date'].dt.month
#df['search_date'].dt.day
#df['search_date'].dt.date

## Dummy Variable

In [388]:
pandas.get_dummies(df['building_use']).head(3)

,倉庫/其他,公寓/住辦,公寓/其他,公寓/分租套房,公寓/店面,公寓/整層住家,公寓/獨立套房,公寓/辦公,公寓/雅房,其他/其他,...,透天厝/辦公,透天厝/雅房,電梯大樓/住辦,電梯大樓/其他,電梯大樓/分租套房,電梯大樓/店面,電梯大樓/整層住家,電梯大樓/獨立套房,電梯大樓/辦公,電梯大樓/雅房
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0

In [391]:
pandas.concat([df, pandas.get_dummies(df['building_use'])], axis = 1).head(3)
#del df['building_use']

,detail_url,search_date,title,address,floor_info,price,layout,building_area,building_use,latitude,...,透天厝/辦公,透天厝/雅房,電梯大樓/住辦,電梯大樓/其他,電梯大樓/分租套房,電梯大樓/店面,電梯大樓/整層住家,電梯大樓/獨立套房,電梯大樓/辦公,電梯大樓/雅房
0,https://rent.591.com.tw/rent-detail-1050934.html,2017-05-14,套房出租-近東方學院(六~八月可入住),高雄市湖內區民生街,3F/3F,4500,NaN,6.0,透天厝/獨立套房,22.878436,...,0,0,0,0,0,0,0,0,0,0
1,https://rent.591.com.tw/rent-detail-1008046.html,2017-05-14,好房子【聰明的你、妳快來租吧】,新北市蘆洲區長安街,4F/5F,7500,NaN,10.0,透天厝/獨立套房,25.081558,...,0,0,0,0,0,0,0,0,0,0
2,https://rent.591.com.tw/rent-detail-1586266.html,2017-05-12,陽台大套房(獨立洗衣機)近頂溪捷運站,新北市永和區中山路一段,8F/12F,11000,NaN,8.0,電梯大樓/分租套房,25.010293,...,0,0,0,0,1,0,0,0,0,0

In [396]:
#df2 = 
df.pivot_table(index='search_date', columns='building_use', values='price', aggfunc='mean')
df2.head()

building_use,倉庫/其他,公寓/住辦,公寓/其他,公寓/分租套房,公寓/店面,公寓/整層住家,公寓/獨立套房,公寓/辦公,公寓/雅房,其他/其他,...,透天厝/辦公,透天厝/雅房,電梯大樓/住辦,電梯大樓/其他,電梯大樓/分租套房,電梯大樓/店面,電梯大樓/整層住家,電梯大樓/獨立套房,電梯大樓/辦公,電梯大樓/雅房
search_date,,,,,,,,,,,,,,,,,,,,,
2017-05-08,72325.0,371500.0,58500.0,1224399.0,4490600.0,4241986.0,2321837.0,1173780.0,401067.0,6000.0,...,121000.0,203499.0,1110800.0,177814.0,453899.0,10574484.0,31536697.0,5276459.0,21835522.0,105900.0
2017-05-09,236744.0,159000.0,42999.0,1579138.0,3362400.0,4206235.0,3048561.0,855900.0,366199.0,NaN,...,392000.0,178000.0,968399.0,579000.0,408299.0,6219799.0,30583975.0,6233755.0,28541573.0,129700.0
2017-05-10,63748.0,494800.0,NaN,2035480.0,7132600.0,5572385.0,5193507.0,1165900.0,493833.0,NaN,...,646800.0,236900.0,1840888.0,825934.0,748549.0,31005928.0,53833067.0,9925236.0,60122996.0,227300.0
2017-05-11,108200.0,242600.0,11000.0,1643348.0,4824099.0,5068078.0,3147599.0,464000.0,583450.0,3500.0,...,314700.0,405470.0,1219550.0,3648149.0,800399.0,12785298.0,46318253.0,7419697.0,29084108.0,229480.0
2017-05-12,60800.0,1096300.0,75000.0,4318694.0,10924080.0,7866946.0,9554327.0,2882900.0,1069600.0,NaN,...,795300.0,608850.0,4139359.0,734820.0,1517399.0,30397667.0,45193426.0,15130740.0,88289435.0,464600.0

In [397]:
df3 = df.pivot_table(index='building_use', columns='search_date', values='price', aggfunc=sum)
df3.head()

search_date,2017-05-08 00:00:00,2017-05-09 00:00:00,2017-05-10 00:00:00,2017-05-11 00:00:00,2017-05-12 00:00:00,2017-05-13 00:00:00,2017-05-14 00:00:00,2017-05-15 00:00:00
building_use,,,,,,,,
倉庫/其他,72325.0,236744.0,63748.0,108200.0,60800.0,231348.0,590250.0,NaN
公寓/住辦,371500.0,159000.0,494800.0,242600.0,1096300.0,1600499.0,1487800.0,421500.0
公寓/其他,58500.0,42999.0,NaN,11000.0,75000.0,234300.0,143000.0,NaN
公寓/分租套房,1224399.0,1579138.0,2035480.0,1643348.0,4318694.0,6571657.0,5744947.0,14800.0
公寓/店面,4490600.0,3362400.0,7132600.0,4824099.0,10924080.0,24972598.0,20999686.0,4686200.0

In [412]:
df['btype'] = df['building_use'].map(lambda e: str(e).split('/')[0])
df['buse']  = df['building_use'].map(lambda e: str(e).split('/')[1] if len(str(e).split('/'))> 1 else None)

In [417]:
df_multi_idx = df.pivot_table(index=['btype', 'buse'], columns='search_date', values='price', aggfunc="mean")

In [418]:
df_multi_idx.head()

search_date    2017-05-08    2017-05-09    2017-05-10    2017-05-11  \
btype buse
倉庫    其他     14465.000000  59186.000000  10624.666667  15457.142857
公寓    住辦     33772.727273  26500.000000  30925.000000  22054.545455
      其他     29250.000000  21499.500000           NaN  11000.000000
      分租套房    7700.622642   8444.588235   8624.915254   7608.092593
      店面     81647.272727  68620.408163  75080.000000  69914.478261

search_date    2017-05-12    2017-05-13    2017-05-14    2017-05-15
btype buse
倉庫    其他     20266.666667  14459.250000  45403.846154           NaN
公寓    住辦     28850.000000  30778.826923  27050.909091  21075.000000
      其他     15000.000000  19525.000000  15888.888889           NaN
      分租套房    8602.976096   7786.323460   7432.014230   4933.333333
      店面     58106.808511  71147.002849  66245.066246  45059.615385

In [419]:
df_wide = df_multi_idx.unstack()
df_wide.head()

search_date    2017-05-08                                                    \
buse                   住辦       其他         分租套房            店面          整層住家
btype
倉庫                    NaN  14465.0          NaN           NaN           NaN
公寓           33772.727273  29250.0  7700.622642  81647.272727  18443.417391
其他                    NaN   6000.0          NaN           NaN           NaN
別墅           60000.000000  27000.0  5966.666667  35000.000000  58100.000000
廠房                    NaN  58000.0          NaN           NaN           NaN

search_date                                    2017-05-09                \
buse                獨立套房       辦公           雅房         住辦            其他
btype
倉庫                   NaN      NaN          NaN        NaN  59186.000000
公寓           8292.275000  97815.0  5729.528571    26500.0  21499.500000
其他                   NaN      NaN          NaN        NaN           NaN
別墅           6222.833333      NaN  4000.000000        NaN  38266.666667
廠房                   NaN      NaN          NaN        NaN  45000.000000

search_date     ...         2017-05-14              2017-05-15      \
buse            ...                 辦公           雅房         住辦  其他
btype           ...
倉庫              ...                NaN          NaN        NaN NaN
公寓              ...       25143.584906  5494.141844    21075.0 NaN
其他              ...                NaN          NaN        NaN NaN
別墅              ...                NaN  5267.692308    34950.0 NaN
廠房              ...                NaN          NaN        NaN NaN

search_date                                                                 \
buse                分租套房            店面          整層住家         獨立套房       辦公
btype
倉庫                   NaN           NaN           NaN          NaN      NaN
公寓           4933.333333  45059.615385  21644.444444  5483.333333  46714.0
其他                   NaN           NaN           NaN          NaN      NaN
別墅           7500.000000  51666.666667  87750.000000  4950.000000      NaN
廠房                   NaN           NaN           NaN          NaN      NaN

search_date
buse                  雅房
btype
倉庫                   NaN
公寓           3466.666667
其他                   NaN
別墅                   NaN
廠房                   NaN

[5 rows x 64 columns]

In [420]:
df_long = df_wide.stack()
df_long.head()

search_date    2017-05-08    2017-05-09    2017-05-10    2017-05-11  \
btype buse
倉庫    其他     14465.000000  59186.000000  10624.666667  15457.142857
公寓    住辦     33772.727273  26500.000000  30925.000000  22054.545455
      其他     29250.000000  21499.500000           NaN  11000.000000
      分租套房    7700.622642   8444.588235   8624.915254   7608.092593
      店面     81647.272727  68620.408163  75080.000000  69914.478261

search_date    2017-05-12    2017-05-13    2017-05-14    2017-05-15
btype buse
倉庫    其他     20266.666667  14459.250000  45403.846154           NaN
公寓    住辦     28850.000000  30778.826923  27050.909091  21075.000000
      其他     15000.000000  19525.000000  15888.888889           NaN
      分租套房    8602.976096   7786.323460   7432.014230   4933.333333
      店面     58106.808511  71147.002849  66245.066246  45059.615385

## 正規表達法

In [421]:
phone = '0912345678'
phone == '0912345678'

p1 = '0912-345-678'
p2 = '0912-345678'
p3 = '091234423499084093840'
p4 = '0922222222'

True

In [424]:
a = '0'

import re

# match
print(re.match('0', a))
# not match
print(re.match('1', a))

<_sre.SRE_Match object; span=(0, 1), match='0'>
None

### 比對數字

In [427]:
a = '5'
# [] 理面的元素是用"或" 來比對
print(re.match('[0123456789]',a))

# - 代表連續
print(re.match('[0-9]',a))

# \d == [0-9]
print(re.match('\d',a))

<_sre.SRE_Match object; span=(0, 1), match='5'>
<_sre.SRE_Match object; span=(0, 1), match='5'>
<_sre.SRE_Match object; span=(0, 1), match='5'>

### 比對英文字母

In [434]:
s = 'g'
print(re.match('[abcdefghijklmnopqrstuvwxyz]', s))

# - 代表連續
print(re.match('[a-z]', s))

s2 = 'G'
# 比對大寫
print(re.match('[a-z]', s2)) # 只能比對到小寫

print(re.match('[a-zA-Z]', s2))

<_sre.SRE_Match object; span=(0, 1), match='g'>
<_sre.SRE_Match object; span=(0, 1), match='g'>
None
<_sre.SRE_Match object; span=(0, 1), match='G'>

### 同時比對數字跟英文字

In [436]:
s = '5'
re.match('[a-zA-Z0-9]', s)

# \w == [a-zA-Z0-9]
re.match('\w', s)

### 比對特殊符號

In [440]:
a = '$'
re.match('\w', a)

# . == 任意字元 
re.match('.', a)

### 比對車牌

In [451]:
s = '9988'

# {} 理面的數字代表要比對到的數量
re.match('\d{4}', s)

# {s,e} s 代表至少有多少符號, e 代表至多有多少符號
re.match('\d{3,5}', s)

# {s, } 至少比對到 s 數量符號
re.match('\d{3,}', s)

# {0, } 至少比對到 0 數量以上符號
re.match('\d{0,}', s)

# * == {0, } 
re.match('\d*', s)


# {1, } 至少比對到 1 數量以上符號
re.match('\d{1,}', s)

# + == {1, } 
re.match('\d+', s)

### 比對電話號碼

In [455]:
p = '0912345678'

re.match('\d{10}', p)

p2 = '1234567890'
re.match('\d{10}', p2)

re.match('09\d{8}', p )

In [459]:
phones = ['0912345678', '0912-345678', '0912-345-678']
for p in phones:
    #print(re.match('09\d{8}' , p))
    #print(re.match('09\d{2}-{0,1}\d{3}-{0,1}\d{3}' , p))
    
    # {0,1} == ?
    print(re.match('09\d{2}-?\d{3}-?\d{3}' , p))

<_sre.SRE_Match object; span=(0, 10), match='0912345678'>
<_sre.SRE_Match object; span=(0, 11), match='0912-345678'>
<_sre.SRE_Match object; span=(0, 12), match='0912-345-678'>

In [465]:
phones = ['0912345678', '0912-345678', '0912-345-678', '0912930183109830130913']
for p in phones:
    # ^ 強制比對開頭, $ 強制結尾
    print(re.match('^09\d{2}-?\d{3}-?\d{3}$' , p))

<_sre.SRE_Match object; span=(0, 10), match='0912345678'>
<_sre.SRE_Match object; span=(0, 11), match='0912-345678'>
<_sre.SRE_Match object; span=(0, 12), match='0912-345-678'>
None